In [1]:
import pandas as pd

data = {
    "Brand": [
        "Apple",
        "Samsung",
        "Apple",
        "Xiaomi",
        "Samsung",
        "Xiaomi",
        "Samsung",
    ],
    "Model": [
        "iphone15",
        "Galaxy24",
        "iphone16",
        "Redme15",
        "Galaxy23",
        "Redme14",
        "Galaxy25",
    ],
    "Release": [
        True,
        True,
        False,
        True,
        True,
        True,
        False,
    ],
}
df = pd.DataFrame(data)
df

     Brand     Model  Release
0    Apple  iphone15     True
1  Samsung  Galaxy24     True
2    Apple  iphone16    False
3   Xiaomi   Redme15     True
4  Samsung  Galaxy23     True
5   Xiaomi   Redme14     True
6  Samsung  Galaxy25    False

In [2]:
df['Brand'].unique()

array(['Apple', 'Samsung', 'Xiaomi'], dtype=object)

In [3]:
df.nunique()

Brand      3
Model      7
Release    2
dtype: int64

In [4]:
df['Brand'].nunique()

3

In [5]:
df['Brand'].value_counts()

Brand
Samsung    3
Apple      2
Xiaomi     2
Name: count, dtype: int64

In [6]:
df['Brand'].value_counts(normalize=True)

Brand
Samsung    0.428571
Apple      0.285714
Xiaomi     0.285714
Name: proportion, dtype: float64

In [9]:
import pandas as pd

df = pd.DataFrame(
    {
        "등급": [
            "하",
            "중",
            "상",
            "하",
            "상",
            "중",
            "하",
        ]
    }
)

df

  등급
0  하
1  중
2  상
3  하
4  상
5  중
6  하

In [34]:
df_categorical = pd.DataFrame(df["등급"])

df_categorical["등급"] = pd.Categorical(
    df_categorical["등급"],
    ["하", "중", "상"], 
    ordered=True
)

df_categorical

  등급
0  하
1  중
2  상
3  하
4  상
5  중
6  하

In [35]:
df_categorical['등급'].dtype

CategoricalDtype(categories=['하', '중', '상'], ordered=True)

In [36]:
df_categorical.sort_values(by='등급')

  등급
0  하
3  하
6  하
1  중
5  중
2  상
4  상

# 실습

## 문제 1

In [ ]:
df = pd.read_csv('./data/car_evaluation.csv')

## 문제 2

In [40]:
print(df.shape)
display(df.head(3))
display(df.tail(3))
display(df.sample(3))

(1728, 7)

,price,maintenance cost,number of doors,number of persons,lug boot,safety,class
0,vhigh,vhigh,2,2,small,low,unacc
1,vhigh,vhigh,2,2,small,med,unacc
2,vhigh,vhigh,2,2,small,high,unacc

,price,maintenance cost,number of doors,number of persons,lug boot,safety,class
1725,low,low,5more,more,big,low,unacc
1726,low,low,5more,more,big,med,good
1727,low,low,5more,more,big,high,vgood

,price,maintenance cost,number of doors,number of persons,lug boot,safety,class
543,high,high,2,2,med,low,unacc
368,vhigh,low,3,4,big,high,acc
972,med,high,2,2,small,low,unacc

## 문제 3

In [44]:
df.nunique()

price                4
maintenance cost     4
number of doors      4
number of persons    3
lug boot             3
safety               3
class                4
dtype: int64

## 문제 4

In [52]:
for col in df.columns:
    print(f"컬림명: {col}\n고유값: {df[col].unique()}\n")

컬림명: price
고유값: ['vhigh' 'high' 'med' 'low']

컬림명: maintenance cost
고유값: ['vhigh' 'high' 'med' 'low']

컬림명: number of doors
고유값: ['2' '3' '4' '5more']

컬림명: number of persons
고유값: ['2' '4' 'more']

컬림명: lug boot
고유값: ['small' 'med' 'big']

컬림명: safety
고유값: ['low' 'med' 'high']

컬림명: class
고유값: ['unacc' 'acc' 'vgood' 'good']

## 문제 5

In [66]:
for col in df.columns:
    print(df[col].value_counts(normalize=True), '\n')

price
low      0.25
med      0.25
high     0.25
vhigh    0.25
Name: proportion, dtype: float64

maintenance cost
vhigh    0.25
high     0.25
med      0.25
low      0.25
Name: proportion, dtype: float64

number of doors
2        0.25
3        0.25
4        0.25
5more    0.25
Name: proportion, dtype: float64

number of persons
2       0.333333
4       0.333333
more    0.333333
Name: proportion, dtype: float64

lug boot
small    0.333333
med      0.333333
big      0.333333
Name: proportion, dtype: float64

safety
low     0.333333
med     0.333333
high    0.333333
Name: proportion, dtype: float64

class
unacc    0.700231
acc      0.222222
good     0.039931
vgood    0.037616
Name: proportion, dtype: float64

## 문제 6

In [67]:
df['number of doors'] = pd.Categorical(
    df['number of doors'],
    ['2', '3', '4', '5more'],
    ordered = True
)

df['number of persons'] = pd.Categorical(
    df['number of persons'],
    ['2', '4', 'more'],
    ordered = True
)

df['price'] = pd.Categorical(
    df['price'],
    ['low', 'med', 'high', 'vhigh'],
    ordered = True
)

df['class'] = pd.Categorical(
    df['class'],
    ['unacc', 'acc', 'good', 'vgood'],
    ordered = True
)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1728 entries, 0 to 1727
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   price              1728 non-null   category
 1   maintenance cost   1728 non-null   object
 2   number of doors    1728 non-null   category
 3   number of persons  1728 non-null   category
 4   lug boot           1728 non-null   object
 5   safety             1728 non-null   object
 6   class              1728 non-null   category
dtypes: category(4), object(3)
memory usage: 48.1+ KB

## 문제 7

In [64]:
df.sort_values(
    by = ['class', 'price'], 
    ascending=[False, True]
)

,price,maintenance cost,number of doors,number of persons,lug boot,safety,class
1421,low,high,2,4,big,high,vgood
1430,low,high,2,more,big,high,vgood
1448,low,high,3,4,big,high,vgood
1454,low,high,3,more,med,high,vgood
1457,low,high,3,more,big,high,vgood
...,...,...,...,...,...,...,...
420,vhigh,low,5more,4,big,low,unacc
423,vhigh,low,5more,more,small,low,unacc
424,vhigh,low,5more,more,small,med,unacc
426,vhigh,low,5more,more,med,low,unacc
429,vhigh,low,5more,more,big,low,unacc

## 문제 8

In [65]:
df.sort_values(
    by = ['price', 'class'], 
    ascending=[True, False]
)

,price,maintenance cost,number of doors,number of persons,lug boot,safety,class
1421,low,high,2,4,big,high,vgood
1430,low,high,2,more,big,high,vgood
1448,low,high,3,4,big,high,vgood
1454,low,high,3,more,med,high,vgood
1457,low,high,3,more,big,high,vgood
...,...,...,...,...,...,...,...
420,vhigh,low,5more,4,big,low,unacc
423,vhigh,low,5more,more,small,low,unacc
424,vhigh,low,5more,more,small,med,unacc
426,vhigh,low,5more,more,med,low,unacc
429,vhigh,low,5more,more,big,low,unacc